tap "auth0/auth0-cli"
tap "bufbuild/buf"
tap "martensson/tpm"
tap "oven-sh/bun"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# New way of working with Protocol Buffers
brew "buf"
# Programming language for highly scalable real-time systems
brew "erlang"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Language Server and Debugger for Elixir
brew "elixir-ls"
# Command-line tool to interact with exercism.io
brew "exercism"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Image loading and rendering library
brew "imlib2"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Platform built on V8 to build network applications
brew "node"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Fast formatter, linter, bundler for JS, TS, JSON
brew "biome"
# Prettier daemon
brew "prettierd"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Automate your tmux workflow
brew "smug"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Opinionated Lua code formatter
brew "stylua"
# LSP for TailwindCSS
brew "tailwindcss-language-server"
# Terminal multiplexer
brew "tmux"
# Color-based alternative to figlet (uses libcaca)
brew "toilet"
# Plugin manager for tmux
brew "tpm"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Build, manage and test your Auth0 integrations from the command line
brew "auth0/auth0-cli/auth0"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
cask "font-jetbrains-mono"
cask "font-roboto-mono-nerd-font"
# Open-source code editor
cask "visual-studio-code"
vscode "bradlc.vscode-tailwindcss"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "hashicorp.terraform"
vscode "jakebecker.elixir-ls"
vscode "ms-vsliveshare.vsliveshare"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "simonsiefke.svg-preview"
vscode "vscodevim.vim"
vscode "wallabyjs.console-ninja"
vscode "wix.vscode-import-cost"
vscode "yoavbls.pretty-ts-errors"
vscode "zxh404.vscode-proto3"
