tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/core"
brew "elixir"
brew "exercism"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "neovim"
brew "rbenv"
brew "ripgrep"
brew "stow"
brew "tmux"
brew "tree"
cask "font-jetbrains-mono-nerd-font"
vscode "bradlc.vscode-tailwindcss"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "hashicorp.terraform"
vscode "JakeBecker.elixir-ls"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "SimonSiefke.svg-preview"
vscode "vscodevim.vim"
vscode "WallabyJs.console-ninja"
vscode "wix.vscode-import-cost"
vscode "yoavbls.pretty-ts-errors"
